app/controllers/jobs_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "job" = ?, "room_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["job", "GM"], ["room_id", 1], ["updated_at", 2017-03-23 07:43:01 UTC], ["id", 1]]
---
    def create
    @room = Room.find(params[:room_id])
    @user = current_user
    if @user.id === @room.user_id
          @user.job = "GM"
      else
          @user.job = "PL"
    end
    @user.room_id = params[:room_id]
    @user.save