app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def top
  	@rooms = Room.all

INSERT INTO "rooms" ("room_name", "user_id", "room_content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["room_name", "neko"], ["user_id", 1], ["room_content", "kann"], ["created_at", 2017-03-19 09:11:49 UTC], ["updated_at", 2017-03-19 09:11:49 UTC]]
---
  def create
  	@room = Room.new
  	@room.room_name = params[:room_name]
  	@room.room_content = params[:room_content]
    @room.user_id = current_user.id
  	@room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = ?  [["room_id", 3]]
SELECT  "joins".* FROM "joins" WHERE "joins"."user_id" = ? AND "joins"."room_id" = ? LIMIT ?  [["user_id", 1], ["room_id", 1], ["LIMIT", 1]]
---
  def show
  	@room = Room.find(params[:id])
    @chats = Chat.where(room_id: params[:id])
    @user = current_user
    @join = current_user.joins.find_by!(room_id: @room.id)